<!-- dflook/terraform-github-actions {"workspace":"checkoutv3-2","backend":"47acca2152bce3021d539d8d37a10a31adadb61873cc4f8029b9bfbede409b58","backend_type":"remote","plan_job_ref":"Job Test Terraform cloud #70 at https://github.com/dflook/terraform-github-actions/actions/runs/3245550363","plan_hash":"fbee30fe092405155f8e09f0dbff24f2f30c7dbf3ead39e6d32ab8a2d331fb7f","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __checkoutv3-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables="from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #70](https://github.com/dflook/terraform-github-actions/actions/runs/3245550363)